# Buttons

button-add-row = ✅ Добавить товар ✅
button-confirm = ✅ Подтверждаю ✅
button-edit-row = 📝 Редактировать товар 📝
button-catalogue = 📜 Каталог 📜
button-great = 👌 Отлично! 👌
button-back = ◀️ Назад
button-next = Вперед ▶️

button-category = 📊 Категория 📊
button-name = 🆕 Название 🆕
button-description = 📑 Описание 📑
button-image = 🏞 Ссылка на картинку 🏞
button-sell-price = 💲 Стоимость 💲
button-self-price = 💲 Себестоимость 💲
button-count = ✖️ Количество ✖️
button-delete = ❌ Удалить ❌

# Messages

start = Приветсвую в интерфейсе 😇 Админа!

        ✅ Добавление новых позиций ✅
        📜 Просмотр текущего каталога 📜

item-list = 📜 Список доступных товаров 📜

add-row-main = Нажми ✅ <b>Добавить товар</b>
               что бы начать процесс добавления
               позиции в 🗂 базу данных.

               Или нажми ◀️ <b>Назад</b>
               что бы вернуться в главное меню

fill-category = Введи 📊 <b>Категорию Товара</b>

                Это может быть строка из букв и цифр

wrong-category = Введена неверная категория

fill-name = Введи 🆕 <b>Название Товара</b>

            Это может быть строка из букв и цифр

wrong-name = Введено неверное название

fill-description = Введи 📑 <b>Описание Товара</b>

                   Это может быть строка из букв и цифр

wrong-description = Введено неверное описание

fill-image = Введи 🔗 ссылку на 🏞 <b>Изображение Товара</b>
             Ссылка должна начинаться на <code>https://</code>
             и заканчиваться расширением изображения, например
             <code>.jpg</code>

             Пример ссылки на изображение с бананом:
             <code>https://fruitonline.ru/image/cache/catalog/ban1-800x1000.jpg</code>

wrong-image = Введена неверная ссылка

fill-price-count = Введи 💱 <b>Стоимость товара</b>
                   <b>Себестоимость</b> (закупочная цена)
                   и <b>Количество товара</b> через пробел.

                   Это должны быть целые числа, <b>Себестоимость</b>
                   не может быть выше чем <b>Стоимость товара</b>

                   Например:
                   <code>1000 750 5</code>

wrong-price-count = Введена неверная цена или количество

confirm-new-item = Проверь введенные данные!

                   📊 Категория Товара: <b>{ $category }</b>
                   🆕 Название Товара: <b>{ $name }</b>
                   📑 Описание Товара:
                   <b>{ $description }</b>

                   🏞 Ссылка на изображение:
                   { $image }

                   💲 Стоимость товара: <b>{ $sell_price }</b>
                   💲 Себестоимоть: <b>{ $self_price }</b>
                   ✖️ Количество товара: <b>{ $count }</b>

                   Если все врено - нажми
                   ✅ Подтверждаю ✅

item-complete = <b>Отлично!</b>

                Товар добавлен в базу данных
                и в пользовательский каталог!

                Можешь вернуться в главное меню или начать
                ввод <b>Нового Товара</b>

item-show = 📊 Категория: <b>{ $category }</b>
            🆕 Название: <b>{ $name }</b>
            📑 Описание:
            <b>{ $description }</b>

            🏞 Ссылка на изображение:
            { $image }

            💲 Стоимость: <b>{ $sell_price }</b>
            💲 Себестоимоть: <b>{ $self_price }</b>
            ✖️ Количество: <b>{ $count }</b>

edit-menu = Что необходимо изменить?

delete-menu = Ты уверен что хочешь удалить
              этот товар?

              📊 <b>{ $category }</b>
              🆕 <b>{ $name }</b>
              📑 <b>{ $description }</b>
              🏞 { $image }

              💲 Стоимость: <b>{ $sell_price }</b>
              💲 Себестоимоть: <b>{ $self_price }</b>
              ✖️ Количество: <b>{ $count }</b>





